# Unit 2 (continuaci√≥n)

In [1]:
import numpy as np
import pandas as pd

In [2]:
# slide 297

df1 = pd.DataFrame({'a':['a0', 'a1', 'a2', 'a3'],
                    'b':['b0', 'b1', 'b2', 'b3'],
                    'c':['c0', 'c1', 'c2', 'c3']
                   }, index=[0,1,2,3])
df1

    a   b   c
0  a0  b0  c0
1  a1  b1  c1
2  a2  b2  c2
3  a3  b3  c3

In [4]:
df2 = pd.DataFrame({'a':['a2', 'a3', 'a4', 'a5'],
                    'b':['b2', 'b3', 'b4', 'b5'],
                    'c':['c2', 'c3', 'c4', 'c5'],
                    'd':['d2', 'd3', 'd4', 'd5']
                   }, index=[2,3,4,5])
df2

    a   b   c   d
2  a2  b2  c2  d2
3  a3  b3  c3  d3
4  a4  b4  c4  d4
5  a5  b5  c5  d5

In [5]:
pd.concat([df1, df2])

    a   b   c    d
0  a0  b0  c0  NaN
1  a1  b1  c1  NaN
2  a2  b2  c2  NaN
3  a3  b3  c3  NaN
2  a2  b2  c2   d2
3  a3  b3  c3   d3
4  a4  b4  c4   d4
5  a5  b5  c5   d5

In [6]:
pd.concat([df1, df2], ignore_index=True)

    a   b   c    d
0  a0  b0  c0  NaN
1  a1  b1  c1  NaN
2  a2  b2  c2  NaN
3  a3  b3  c3  NaN
4  a2  b2  c2   d2
5  a3  b3  c3   d3
6  a4  b4  c4   d4
7  a5  b5  c5   d5

In [7]:
pd.concat([df1, df2], keys=['A','B'])

      a   b   c    d
A 0  a0  b0  c0  NaN
  1  a1  b1  c1  NaN
  2  a2  b2  c2  NaN
  3  a3  b3  c3  NaN
B 2  a2  b2  c2   d2
  3  a3  b3  c3   d3
  4  a4  b4  c4   d4
  5  a5  b5  c5   d5

In [8]:
pd.concat([df1, df2], axis='columns') # axis=1

     a    b    c    a    b    c    d
0   a0   b0   c0  NaN  NaN  NaN  NaN
1   a1   b1   c1  NaN  NaN  NaN  NaN
2   a2   b2   c2   a2   b2   c2   d2
3   a3   b3   c3   a3   b3   c3   d3
4  NaN  NaN  NaN   a4   b4   c4   d4
5  NaN  NaN  NaN   a5   b5   c5   d5

## 2.4 DataFrame Sorting and Multi-Index

### Sorting

In [12]:
df = pd.DataFrame(np.random.randint(10,size=(4,5)))
df

   0  1  2  3  4
0  0  9  1  7  5
1  3  2  1  7  2
2  9  1  2  5  5
3  3  0  7  1  6

In [13]:
df.sort_values(by=1, ascending=False)

   0  1  2  3  4
0  0  9  1  7  5
1  3  2  1  7  2
2  9  1  2  5  5
3  3  0  7  1  6

In [14]:
df.sort_values(by=[3,4])

   0  1  2  3  4
3  3  0  7  1  6
2  9  1  2  5  5
1  3  2  1  7  2
0  0  9  1  7  5

In [15]:
df.sort_values(by=[3,4],ascending=[False,True])

   0  1  2  3  4
1  3  2  1  7  2
0  0  9  1  7  5
2  9  1  2  5  5
3  3  0  7  1  6

In [18]:
df.sort_values(by=0,axis='columns')

   0  2  4  3  1
0  0  1  5  7  9
1  3  1  2  7  2
2  9  2  5  5  1
3  3  7  6  1  0

###  Hierarchical indexing

In [20]:
my_header = ['a', 'b', 'c']
my_index_out = ['G1']*3 + ['G2']*3
my_index_in  = [1,2,3]*2
my_index_zipped = list(zip(my_index_out, my_index_in))
my_index_zipped

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [21]:
my_index = pd.MultiIndex.from_tuples(my_index_zipped)
my_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [22]:
df = pd.DataFrame(data=np.random.randn(6,3),
                  index=my_index,
                  columns=my_header)
df

             a         b         c
G1 1  0.430755  0.542594  0.970635
   2  0.087934  3.390723  0.156159
   3 -0.820513 -0.066098 -0.141071
G2 1  0.234437 -1.006629 -2.292022
   2 -0.874579  1.346255  0.293680
   3 -0.448118 -0.588567 -1.175134

In [23]:
# ojo!!!!
pd.DataFrame(data=np.random.randn(6,3),
             index=my_index_zipped,
             columns=my_header)

                a         b         c
(G1, 1)  1.327186 -0.325373 -0.737654
(G1, 2)  0.505950  0.833691 -0.641073
(G1, 3)  0.330852 -1.049912  0.672619
(G2, 1)  0.468688 -0.769824  1.067006
(G2, 2) -0.263597 -0.424848  0.612476
(G2, 3) -0.985987  2.072826  1.665252

## Unit 2.5

### DataFrame Summarization. Grouping and Summarizing

In [26]:
df = pd.read_csv('08. data_studentlist.csv')
df.head()

              name gender  age  grade absence bloodtype  height  weight
0    Jared Diamond      M   23      3       Y         O   165.3    68.2
1   Sarah O'Donnel      F   22      2       N        AB   170.1    53.0
2     Brian Martin      M   24      4       N         B   175.0    80.1
3     David Hassel      M   23      3       N        AB   182.1    85.7
4  Clara Rodriquez      F   20      1       Y         A   168.0    49.5

In [27]:
df.groupby(['gender','bloodtype'])

In [28]:
df.groupby(['gender','bloodtype'])['height']

In [29]:
df.groupby(['gender','bloodtype'])['height'].mean()

gender  bloodtype
F       A            172.450000
        AB           170.100000
        B            158.200000
        O            164.433333
M       A            165.700000
        AB           181.050000
        B            174.550000
        O            166.200000
Name: height, dtype: float64

In [30]:
type(df.groupby(['gender','bloodtype'])['height'].mean())

pandas.core.series.Series

### DataFrame Summarization. Pivoting

In [33]:
my_dict = {'Size': list('LLMMMSSSS'),
           'Type': list('AAABBAABB'),
           'Location':[ 'L'+x for x in '111221221'],
           'A':[1,2,2,3,3,4,5,6,7],
           'B':[2,4,5,5,6,6,8,9,9]}
my_dict

{'Size': ['L', 'L', 'M', 'M', 'M', 'S', 'S', 'S', 'S'],
 'Type': ['A', 'A', 'A', 'B', 'B', 'A', 'A', 'B', 'B'],
 'Location': ['L1', 'L1', 'L1', 'L2', 'L2', 'L1', 'L2', 'L2', 'L1'],
 'A': [1, 2, 2, 3, 3, 4, 5, 6, 7],
 'B': [2, 4, 5, 5, 6, 6, 8, 9, 9]}

In [34]:
df = pd.DataFrame(my_dict)
df

  Size Type Location  A  B
0    L    A       L1  1  2
1    L    A       L1  2  4
2    M    A       L1  2  5
3    M    B       L2  3  5
4    M    B       L2  3  6
5    S    A       L1  4  6
6    S    A       L2  5  8
7    S    B       L2  6  9
8    S    B       L1  7  9

Index by 'Size' and 'Type'. Columns by 'Location'. Values provided by the 'B' column:

In [35]:
dfr = pd.pivot_table(df,
                     index=['Size','Type'],
                     columns='Location',
                     values='B')
dfr

Location    L1   L2
Size Type
L    A     3.0  NaN
M    A     5.0  NaN
     B     NaN  5.5
S    A     6.0  8.0
     B     9.0  9.0

In [36]:
dfr.columns

Index(['L1', 'L2'], dtype='object', name='Location')

In [37]:
dfr.index

MultiIndex([('L', 'A'),
            ('M', 'A'),
            ('M', 'B'),
            ('S', 'A'),
            ('S', 'B')],
           names=['Size', 'Type'])

In [38]:
pd.pivot_table(df,
               index=['Size','Type'],
               columns='Location',
               values='B',
               fill_value=0)

Location   L1   L2
Size Type
L    A      3  0.0
M    A      5  0.0
     B      0  5.5
S    A      6  8.0
     B      9  9.0

In [39]:
pd.pivot_table(df,
               index=['Size','Type'],
               columns='Location',
               values='B',
               aggfunc=np.mean, # era valor por defecto
               fill_value=0)

Location   L1   L2
Size Type
L    A      3  0.0
M    A      5  0.0
     B      0  5.5
S    A      6  8.0
     B      9  9.0

In [40]:
pd.pivot_table(df,
               index=['Size','Type'],
               columns='Location',
               values='B',
               aggfunc=np.sum,
               fill_value=0)

Location   L1  L2
Size Type
L    A      6   0
M    A      5   0
     B      0  11
S    A      6   8
     B      9   9

In [45]:
pd.pivot_table(df,
               index=['Size','Type'],
               columns='Location',
               values='B',
               aggfunc=np.median,
               fill_value=0)

Location   L1   L2
Size Type
L    A      3  0.0
M    A      5  0.0
     B      0  5.5
S    A      6  8.0
     B      9  9.0

In [41]:
dfr = pd.pivot_table(df,
                     index='Location',
                     columns=['Size','Type'],
                     values='B')
dfr

Size        L    M         S
Type        A    A    B    A    B
Location
L1        3.0  5.0  NaN  6.0  9.0
L2        NaN  NaN  5.5  8.0  9.0

In [42]:
dfr.index

Index(['L1', 'L2'], dtype='object', name='Location')

In [43]:
dfr.columns

MultiIndex([('L', 'A'),
            ('M', 'A'),
            ('M', 'B'),
            ('S', 'A'),
            ('S', 'B')],
           names=['Size', 'Type'])

In [48]:
df

  Size Type Location  A  B
0    L    A       L1  1  2
1    L    A       L1  2  4
2    M    A       L1  2  5
3    M    B       L2  3  5
4    M    B       L2  3  6
5    S    A       L1  4  6
6    S    A       L2  5  8
7    S    B       L2  6  9
8    S    B       L1  7  9

In [46]:
# group averages of the columns 'A' and 'B'
pd.pivot_table(df, index=['Size','Type'], values=['A','B'], aggfunc=np.mean)

             A    B
Size Type
L    A     1.5  3.0
M    A     2.0  5.0
     B     3.0  5.5
S    A     4.5  7.0
     B     6.5  9.0

In [50]:
# otra manera de hacer lo mismo:
df.groupby(['Size','Type'])[['A','B']].mean()

             A    B
Size Type
L    A     1.5  3.0
M    A     2.0  5.0
     B     3.0  5.5
S    A     4.5  7.0
     B     6.5  9.0

In [51]:
# es posible agregar las columnas 'A' y 'B' de forma diferente:
# group averages of the columns 'A' and 'B'
pd.pivot_table(df, index=['Size','Type'], values=['A','B'],
               aggfunc={'A':np.max,'B':np.min})

           A  B
Size Type
L    A     2  2
M    A     2  5
     B     3  5
S    A     5  6
     B     7  9

### Statistics

In [55]:
df.sum(axis='index') # o axis=0

Size                 LLMMMSSSS
Type                 AAABBAABB
Location    L1L1L1L2L2L1L2L2L1
A                           33
B                           54
dtype: object

In [56]:
df.sum(axis='columns') # o axis=1, da un warning:

/tmp/ipykernel_539378/1397503860.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.sum(axis='columns') # o axis=1, da un warning:

0     3
1     6
2     7
3     8
4     9
5    10
6    13
7    15
8    16
dtype: int64

In [58]:
df.loc[:,'Size':'Location'].sum(axis='columns')

0    LAL1
1    LAL1
2    MAL1
3    MBL2
4    MBL2
5    SAL1
6    SAL2
7    SBL2
8    SBL1
dtype: object

In [59]:
df.loc[:,['A','B']].sum(axis='columns')

0     3
1     6
2     7
3     8
4     9
5    10
6    13
7    15
8    16
dtype: int64

In [63]:
df[['A','B']].mean(axis=0, skipna=False)

A    3.666667
B    6.000000
dtype: float64

In [64]:
df.describe()

              A         B
count  9.000000  9.000000
mean   3.666667  6.000000
std    2.000000  2.345208
min    1.000000  2.000000
25%    2.000000  5.000000
50%    3.000000  6.000000
75%    5.000000  8.000000
max    7.000000  9.000000

In [65]:
df.count(axis='index')

Size        9
Type        9
Location    9
A           9
B           9
dtype: int64

In [66]:
df.A.corr(df.B)

0.9594032236002469

In [67]:
df.corr()

          A         B
A  1.000000  0.959403
B  0.959403  1.000000

In [68]:
df.corrwith(df.A)

A    1.000000
B    0.959403
dtype: float64

In [70]:
df.isnull()

    Size   Type  Location      A      B
0  False  False     False  False  False
1  False  False     False  False  False
2  False  False     False  False  False
3  False  False     False  False  False
4  False  False     False  False  False
5  False  False     False  False  False
6  False  False     False  False  False
7  False  False     False  False  False
8  False  False     False  False  False

In [72]:
df.isnull().sum(axis='index')

Size        0
Type        0
Location    0
A           0
B           0
dtype: int64

In [73]:
import seaborn as sns

In [74]:
titanic = sns.load_dataset('titanic')

In [75]:
titanic.isnull().sum(axis='index')

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [76]:
titanic.isnull().mean(axis='index')

survived       0.000000
pclass         0.000000
sex            0.000000
age            0.198653
sibsp          0.000000
parch          0.000000
fare           0.000000
embarked       0.002245
class          0.000000
who            0.000000
adult_male     0.000000
deck           0.772166
embark_town    0.002245
alive          0.000000
alone          0.000000
dtype: float64

In [79]:
taf = titanic[['age','fare']]
taf.tail()

      age   fare
886  27.0  13.00
887  19.0  30.00
888   NaN  23.45
889  26.0  30.00
890  32.0   7.75

In [80]:
taf.dropna(axis='index').tail()

      age    fare
885  39.0  29.125
886  27.0  13.000
887  19.0  30.000
889  26.0  30.000
890  32.0   7.750

In [82]:
taf.dropna(axis='columns').tail()

      fare
886  13.00
887  30.00
888  23.45
889  30.00
890   7.75

In [83]:
taf.fillna(value=0).tail()

      age   fare
886  27.0  13.00
887  19.0  30.00
888   0.0  23.45
889  26.0  30.00
890  32.0   7.75